app/Controllers/Auth.php

SELECT `o`.`order_id`, `o`.`order_number`, `o`.`created_at`, `o`.`payment_method`, `o`.`total_amount`, `o`.`order_status`, `oi`.`order_item_id`, `oi`.`product_id`, `oi`.`product_name`, `oi`.`category_name`, `oi`.`qty`, `oi`.`line_total`, `p`.`main_image`
FROM `order_tbl` `o`
JOIN `order_item_tbl` `oi` ON `oi`.`order_id` = `o`.`order_id`
LEFT JOIN `product_tbl` `p` ON `p`.`product_id` = `oi`.`product_id`
WHERE `o`.`user_id` = 4
ORDER BY `o`.`created_at` DESC, `o`.`order_id` DESC, `oi`.`order_item_id` ASC
---
        if ($activeTab === 'history') {
            $db = \Config\Database::connect();

            $rows = $db->table('order_tbl o')
                ->select('
                    o.order_id,
                    o.order_number,
                    o.created_at,
                    o.payment_method,
                    o.total_amount,
                    o.order_status,
                    oi.order_item_id,
                    oi.product_id,
                    oi.product_name,
                    oi.category_name,
                    oi.qty,
                    oi.line_total,
                    p.main_image
                ')
                ->join('order_item_tbl oi', 'oi.order_id = o.order_id')
                ->join('product_tbl p', 'p.product_id = oi.product_id', 'left')
                ->where('o.user_id', (int) session('user_auth_id'))
                ->orderBy('o.created_at', 'DESC')
                ->orderBy('o.order_id', 'DESC')
                ->orderBy('oi.order_item_id', 'ASC')
                ->get()
                ->getResultArray();

SELECT `order_id`, `order_status`, `eta_half_at`, `eta_due_at`, `stock_applied`
FROM `order_tbl`
WHERE `user_id` = 4
AND `order_status` IN ('pending','on_the_way')
---
    private function syncSimulatedOrderStatuses(int $userId): void
    {
        $db = \Config\Database::connect();
        $now = date('Y-m-d H:i:s');

        $orders = $db->table('order_tbl')
            ->select('order_id, order_status, eta_half_at, eta_due_at, stock_applied')
            ->where('user_id', $userId)
            ->whereIn('order_status', ['pending', 'on_the_way'])
            ->get()
            ->getResultArray();