app/Controllers/Cart.php

    public function index()
    {
        if ($redirect = $this->requireUser()) {
            return $redirect;
        }

        $userId = (int) session('user_auth_id');

        $db = \Config\Database::connect();

        $items = $db->table('cart_tbl c')
            ->select('
                ci.cart_item_id,
                ci.qty,
                ci.unit_price,
                p.product_id,
                p.product_name,
                p.main_image,
                p.stock_qty,
                p.category_id,
                pc.category_name
            ')
            ->join('cart_item_tbl ci', 'ci.cart_id = c.cart_id')
            ->join('product_tbl p', 'p.product_id = ci.product_id')
            ->join('product_category_tbl pc', 'pc.category_id = p.category_id', 'left')
            ->where('c.user_id', $userId)
            ->where('p.is_active', 1)
            ->orderBy('ci.cart_item_id', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `ci`.`cart_item_id`, `ci`.`qty`, `ci`.`unit_price`, `p`.`product_id`, `p`.`product_name`, `p`.`main_image`, `p`.`stock_qty`, `p`.`category_id`, `pc`.`category_name`
FROM `cart_tbl` `c`
JOIN `cart_item_tbl` `ci` ON `ci`.`cart_id` = `c`.`cart_id`
JOIN `product_tbl` `p` ON `p`.`product_id` = `ci`.`product_id`
LEFT JOIN `product_category_tbl` `pc` ON `pc`.`category_id` = `p`.`category_id`
WHERE `c`.`user_id` = 4
AND `p`.`is_active` = 1
ORDER BY `ci`.`cart_item_id` DESC